In [1]:
import pandas as pd

In [2]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [3]:
cast = pd.read_csv('cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [11]:
titles['title'].count()

244914

### What are the earliest two films listed in the titles dataframe?

In [20]:
titles.sort_values("year").head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [21]:
len(titles[titles['title'].str.contains("Hamlet")])

57

### How many movies are titled "North by Northwest"?

In [22]:
titles[titles['title'].str.contains("North by Northwest")].title.count()

1

### When was the first movie titled "Hamlet" made?

In [24]:
titles[titles['title']=='Hamlet'].sort_values('year').head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [25]:
titles[titles['title'].str.contains("Treasure Island")].sort_values('year')

                                                    title  year
55686                                     Treasure Island  1918
196514                                    Treasure Island  1920
141822                                    Treasure Island  1934
64173                       The Secret of Treasure Island  1938
79701                     Charlie Chan at Treasure Island  1939
77354                                     Treasure Island  1950
34341                           Return to Treasure Island  1954
34288                           Five on a Treasure Island  1957
65051                                     Treasure Island  1972
37238                                     Treasure Island  1973
173051                                    Treasure Island  1985
26111                              Muppet Treasure Island  1996
27076                                     Treasure Island  1999
216970                               Treasure Island (II)  1999
209707  Treasure Island Kids: The Battle of Treasure I...  2006
2830                           Pirates of Treasure Island  2006
112591  Treasure Island Kids: The Mystery of Treasure ...  2006
244541  Treasure Island Kids: The Monster of Treasure ...  2006
155317             National Theatre Live: Treasure Island  2015

### How many movies were made in the year 1950?

In [27]:
len(titles[titles['year']==1950])

1113

### How many movies were made in the year 1960?

In [29]:
len(titles[titles['year']==1960])

1549

### How many movies were made from 1950 through 1959?

In [31]:
len(titles[(titles['year']>=1950) & (titles['year']<=1959)])

12934

### In what years has a movie titled "Batman" been released?

In [32]:
titles[titles['title'].str.contains("Batman")].sort_values('year')

                                              title  year
39349                                        Batman  1943
204905                             Batman and Robin  1949
93271                                Batman Dracula  1964
34251                         Alyas Batman at Robin  1965
180265                                 James Batman  1966
134007                            Batman: The Movie  1966
170948                        Batman Fights Dracula  1967
91440                         Fight! Batman, Fight!  1973
240896                                       Batman  1989
183764                        Alyas Batman en Robin  1991
21158                                Batman Returns  1992
92106                  Batman: Mask of the Phantasm  1993
163887                               Batman Forever  1995
153828                               Batman & Robin  1997
223791                                Batman Begins  2005
3609                                 Batman Reboots  2010
78155                     Batman: The Final Victory  2010
49259                                 Batman Untold  2010
161608                              Batman Revealed  2012
139039                             Batman: Crusader  2014
143064                 Batman Beyond: Rising Knight  2014
56896            Batman v Superman: Dawn of Justice  2016
29920                               Batman: Anarchy  2016
192806           B@: It's a Wonderful Life, Batman!  2016
42483                      Batman: The Killing Joke  2016
130474        Batman: Return of the Caped Crusaders  2016
93833                       B@ (Batman Parody Film)  2016
230776                       Batman: Master of Fear  2017
213182                Batman the Dawn of the Knight  2017
26577                         The LEGO Batman Movie  2017
63068              Batman V Superman: League at War  2018
161657                  Batman the Rise of Red Hood  2018
194288  Scooby-Doo & Batman: the Brave and the Bold  2018
108277                                 Batman Ninja  2018
127552                              Batman Unveiled  2018

### How many roles were there in the movie "Inception"?

In [33]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [35]:
cast[cast['title']== "Inception"]['character'].count()

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [36]:
cast[(cast.title== "Inception") & (cast['n'].isnull()) ].character.count()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [37]:
cast[(cast.title== "Inception") & (cast['n'].notnull()) ].character.count()

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [43]:
cast[(cast['title']=='North by Northwest') & (cast['n'].notnull())][['name','n']].sort_values('n')

                         name     n
871426             Cary Grant   1.0
3518333       Eva Marie Saint   2.0
1457165           James Mason   3.0
3157232   Jessie Royce Landis   4.0
356707         Leo G. Carroll   5.0
3048272  Josephine Hutchinson   6.0
1695173           Philip Ober   7.0
1275337         Martin Landau   8.0
2447081         Adam Williams   9.0
1811387          Edward Platt  10.0
665768      Robert Ellenstein  11.0
2295714          Les Tremayne  12.0
464736        Philip Coolidge  13.0
1508344         Patrick McVey  14.0
206471           Edward Binns  15.0
1384780             Ken Lynch  16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [48]:
cast[(cast['title']=='Sleuth') & (cast['n'].notnull()) & (cast['year']==1972) ][['name','n']].sort_values('n')

                       name    n
1705394    Laurence Olivier  1.0
326773        Michael Caine  2.0
373876       Alec Cawthorne  3.0
1465483  John (II) Matthews  4.0
2724553  Eve (III) Channing  5.0
1448690        Teddy Martin  6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [50]:
cast[(cast['title'] == 'Sleuth') & (cast['year'] == 2007)].sort_values('n')

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [52]:
len(cast[(cast['title']=='Hamlet') & (cast['year']==1921)])

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [53]:
len(cast[(cast['title']=='Hamlet') & (cast['year']==1996) ])

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [54]:
cast[(cast['title']=='Hamlet')].character.count()

342

### How many people have played an "Ophelia"?

In [55]:
cast[(cast['character']=='Ophelia')].character.count()

117

### How many people have played a role called "The Dude"?

In [56]:
cast[(cast['character']=='The Dude')].character.count()

19

### How many people have played a role called "The Stranger"?

In [57]:
cast[(cast['character']=='The Stranger')].character.count()

212

### How many roles has Sidney Poitier played throughout his career?

In [58]:
cast[(cast['name']=='Sidney Poitier')].character.count()

43

### How many roles has Judi Dench played?

In [59]:
cast[(cast['name']=='Judi Dench')].character.count()

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [61]:
cast[(cast['name']=='Cary Grant') & (cast['year']>=1940) &((cast['year']<1950))  & (cast['n']==2)].sort_values('year')

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [62]:
cast[(cast['name']=='Cary Grant') & (cast['year']>=1940) &((cast['year']<1950))  & (cast['n']==1)][['character','year','n']].sort_values('year')

                                   character  year    n
871448                           Matt Howard  1940  1.0
871407                          Walter Burns  1940  1.0
871450                    C. K. Dexter Haven  1940  1.0
871438                      Johnnie Aysgarth  1941  1.0
871452                          Leopold Dilg  1942  1.0
871429                 Patrick 'Pat' O'Toole  1942  1.0
871398                         Capt. Cassidy  1943  1.0
871422  Joe Adams -posing as Joe Bascopolous  1943  1.0
871430                           Jerry Flynn  1944  1.0
871390                     Mortimer Brewster  1944  1.0
871425                            Ernie Mott  1944  1.0
871424                           Cole Porter  1946  1.0
871427                                Devlin  1946  1.0
871444                           Dick Nugent  1947  1.0
871445                                Dudley  1947  1.0
871421                         Jim Blandings  1948  1.0
871402                     Dr. Madison Brown  1948  1.0
871411                 Captain Henri Rochard  1949  1.0

### How many roles were available for actors in the 1950s?

In [65]:
cast[(cast['type']=='actor') & (cast['year']>=1950) & (cast['year']<1960)].character.count()

157738

### How many roles were available for actresses in the 1950s?

In [66]:
cast[(cast['type']=='actress') & (cast['year']>=1950) & (cast['year']<1960)].character.count()

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [74]:
cast[(cast['n']==1) & (cast['year']<=1980)].character.count()

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [75]:
cast[(cast['n']!=1) & (cast['year']<=1980)].character.count()

1117667

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [76]:
cast[(cast['n'].isnull()) & (cast['year']<=1980)].character.count()

448347